---
kind: method
id: M:Autodesk.Revit.DB.Analysis.PathOfTravel.GetWaypoints
source: html/dad6abd9-812c-f9bb-e7b9-d4a3c2e32bef.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravel.GetWaypoints Method

return the waypoints set for the Path of Travel

## Syntax (C#)
```csharp
public IList<XYZ> GetWaypoints()
```